app/controllers/empregados_controller.rb

SELECT "empregados".* FROM "empregados"
---
  def index
    @empregados = Empregado.all

SELECT "empresas".* FROM "empresas"
SELECT "compromissos".* FROM "compromissos"
---
  def new
    @empresas = Empresa.all
    @compromissos = Compromisso.all